{
  "listening": [
    "(The teacher, was listening to, the students)",
    "(The teacher, was listening, to the students), (The teacher, was standing, near the chalkboard), (The students, answered, questions), (The teacher, was nodding, occasionally), (The teacher, was jotting down, notes)",
    "(Teacher, was listening, to students' responses), (Teacher, was scanning, the classroom), (Teacher, nodded, encouragingly), (Teacher, pushed, his glasses), (Teacher, scribbled notes, on pad)"
  ],
  "reading": [
    "(\"The student\", \"is reading\", \"a novel\")",
    "(\"The student\", \"is reading\", \"a novel\"), (\"The student\", \"is looking up\", \"to watch the teacher\")",
    "(The student, is reading, a novel quietly), (Her eyes, are scanning, the pages intently), (She, nods, in understanding), (She, furrows, her brow subtly), (The teacher, gesture, towards the whiteboard)"
  ],
  "using_phone": [
    "(The teacher, is using, the phone)",
    "(teacher, is using, phone), (students, work on, assignments)",
    "(The teacher, is using, the phone), (The teacher, is perched on, the edge of her desk), (The teacher, pauses, intermittently), (The teacher, scans, the room), (The teacher, nods at, students)"
  ],
  "using_pad": [
    "(A student, is using, a pad)",
    "(student, is using, digital pad), (student, is taking, notes), (student, is referencing, textbook)",
    "(student, leans slightly forward, using a digital pad), (student, looks up, nodding in understanding), (student, furrows, her brows), (student, listens intently, to the professor's lecture), (student, flips through, pages of a textbook)"
  ],
  "using_computers": [
    "(Students, are using, computers), (Students, complete, their assignments)",
    "(groups of students, are using, computers), (groups of students, are completing, their science projects), (teacher, assists, them)",
    "(students, use, computers), (students, glide, fingers), (students, whisper to, classmate), (students, raise, hand), (teacher, pauses, frequently)"
  ],
  "scratching_head": [
    "(student, is scratching, head), (student, is trying, solve math problem), (math problem, is in, classroom), (classroom, is, noisy)",
    "(student, is scratching, head), (student, is glancing at, equations on the whiteboard), (student, is seeking, hints from classmates)",
    "(student, scratches, head), (student, squints at, equations), (student, picks up, snippets of explanations), (student, shows, struggle and engagement), (student, leans forward, slightly)"
  ],
  "writing": [
    "(The teacher, is writing, math problems), (The teacher, is writing, on the whiteboard), (The teacher, is in, the bustling classroom)",
    "(The teacher, is writing, complex math problems on the whiteboard), (students, jot down, notes at their desks)",
    "(The teacher, is writing, math problems), (She, pauses, occasionally), (She, adjusts, her glasses), (She, scans, the room), (Students, are jotting down, notes)"
  ],
  "talking": [
    "(The teacher, was talking to, the students)",
    "(teacher, was talking to, students), (teacher, pointing at, whiteboard)",
    "(teacher, paced, in front of the whiteboard), (teacher, gesturing, towards key concepts), (teacher, pausing, to make eye contact with several students), (teacher, talking, to the attentive students), (students, were, engaged)"
  ],
  "standing": [
    "(Ms. Thompson, is standing in front of, the whiteboard)",
    "(Ms. Thompson, is standing in front of, the whiteboard), (Ms. Thompson, is pointing to, a math problem), (the students, watch, attentively)",
    "(Ms. Thompson, is standing, in front of the whiteboard), (Ms. Thompson, is pointing, to a math problem), (Her eyes, scan, the room), (Ms. Thompson, explains, the steps), (students, show, engagement and understanding)"
  ],
  "sleeping": [
    "(The student, was sleeping, at her desk)",
    "(student, was sleeping, at her desk), (classmates, worked, on their assignments)",
    "(The student, was sleeping, at her desk), (her head, resting, on her folded arms), (her classmates, worked, on their assignments), (she, would stir, slightly), (she, mumble, in her sleep)"
  ],
  "teaching": [
    "(teacher, was teaching, students)",
    "(teacher, was teaching, students), (teacher, was using, digital projector), (teacher, was using, interactive quizzes), (classroom, was, brightly-lit), (students, were, eager)",
    "(teacher, navigated, between whiteboard and desks), (teacher, responded, to students' questions), (teacher, adjusted, digital projector), (teacher, created, learning environment), (teacher, checked, with individuals)"
  ],
  "yawning": [
    "(Mr. Thompson, is seated, at his desk), (Mr. Thompson, is grading, papers), (Mr. Thompson, is yawning, -), (classroom clock, ticks, monotonously)",
    "(Mr. Thompson, is seated, at his desk), (Mr. Thompson, is grading, stack of papers), (classroom clock, ticks, monotonously), (students, are whispering, quietly), (students, are giggling, quietly)",
    "(Mr. Thompson, stifles, yawn), (His eyes, meet, clock's ticking), (He, offers, weary smile), (He, shakes, head), (He, attempts, to refocus attention)"
  ],
  "walking": [
    "(Mr. Thompson, was walking between, rows of desks), (Mr. Thompson, was checking, students' progress)",
    "(Mr. Thompson, was walking slowly, between the rows of desks), (Mr. Thompson, pausing occasionally, to lean over a student's shoulder), (Mr. Thompson, offer guidance, on their math assignment)",
    "(Mr. Thompson, walked thoughtfully between, rows of desks), (His eyes, scanning over, students' work), (He, stopped to adjust, his glasses), (He, jot small notes on, his clipboard), (He, offering, gentle smile or word of encouragement)"
  ],
  "relaxing": [
    "(The teacher, is relaxing, in her chair)",
    "(teacher, is relaxing, in chair), (teacher, sipping, coffee), (teacher, enjoying, quiet moment), (students, read, silently)",
    "(The teacher, is relaxing, in her chair), (She, sips, her coffee), (She, glances, to observe the students), (She, nods, in approval), (She, offers, a gentle smile)"
  ],
  "analyzing": [
    "(The chemistry teacher, is analyzing, the experiment results)",
    "(chemistry teacher, is analyzing, experiment results), (students, gather around, lab table), (students, awaiting, feedback)",
    "(chemistry teacher, peers at, laptop screen), (chemistry teacher, analyzes, experiment results), (chemistry teacher, looks up to explain, graph), (chemistry teacher, uses, hands to emphasize key concepts), (students, jot down, notes)"
  ],
  "taking_bottle": [
    "(The teacher, walked over to, the shelf), (The teacher, started taking, bottles of chemicals)",
    "(students, gathered around, teacher), (teacher, walked over to, shelf), (teacher, started taking, bottles of chemicals)",
    "(teacher, navigated, through crowd of students), (She, reached, shelf), (She, pushed aside, papers), (She, began taking, bottles of chemicals), (She, held up, bottles)"
  ],
  "gathering_up_bag": [
    "(Ms. Johnson, was gathering up, her bag), (her bag, was from beneath, the desk), (the desk, was at, the front of the classroom), (students, filed out, )",
    "(Ms. Johnson, was gathering, her bag), (bag, strewn with, papers and books), (desk, at, the front)",
    "(Ms. Johnson, bent down, her hand), (her hand, brushing past, loose pens and sticky notes), (Ms. Johnson, paused, occasionally), (Ms. Johnson, respond, with a smile or a nod), (her other hand, smoothing down, stray papers)"
  ],
  "drinking": [
    "(Ms. Johnson, is drinking, coffee), (Ms. Johnson, is grading, papers)",
    "(Ms. Johnson, is drinking, coffee), (Ms. Johnson, is using, mug), (Ms. Johnson, is grading, papers), (students, work on, assignments), (assignments, are in, classroom)",
    "(Ms. Johnson, sips from, mug of coffee), (Ms. Johnson, nods in, approval), (Ms. Johnson, offers, smile), (Ms. Johnson, observes, students), (Ms. Johnson, answers, student's query)"
  ],
  "taking_photos": [
    "(Mr. Johnson, is taking photos, of the students)",
    "(Mr. Johnson, is taking, photos), (students, displaying, artwork), (classmates, eagerly watch, students), (students, are in, classroom), (art class presentation, occurs in, classroom)",
    "(Mr. Johnson, is taking, photos), (students, displaying, artwork), (classmates, gather around, students), (some, pointing, in admiration), (others, whispering, in admiration)"
  ],
  "listening_to_music": [
    "(The student, is listening to, music), (The student, is sitting at, a desk), (The desk, is in, the classroom)",
    "(The student, is listening to, music), (The student, is sitting at, a desk), (The student, is sitting in, the classroom), (classmates, focus on, their assignments), (The student, is nodding along to, the beat)",
    "(student, is listening to, music), (student, is tapping, foot), (student, glances up from, notebook), (teacher, is explaining, lesson), (student, is nodding, in understanding)"
  ],
  "discussing": [
    "(The teacher, is discussing, the importance of Shakespeare's plays), (The teacher, is discussing, with the students), (The discussion, is in, the bustling high school classroom)",
    "(The teacher, is discussing, the importance of Shakespeare's plays), (The students, are taking, notes), (The students, are asking, questions)",
    "(teacher, gestures towards, quotes), (students, follow, discussion), (students, raise, hands), (students, nod in, understanding), (students, scribble, notes)"
  ],
  "setting_equipment": [
    "(The teacher, is setting up, the equipment)",
    "(teacher, is setting up, microscope), (teacher, is setting up, slides), (students, gather around, table)",
    "(The teacher, is adjusting, the microscope), (The teacher, is answering, questions), (She, nods and smiles, encouraging), (She, hands out, slides), (group, gathered, around her)"
  ],
  "taking_bag": [
    "(student, taking, bag)",
    "(student, is taking, bag), (student, is avoiding, bumping into classmate), (classmate, is tying, shoelaces)",
    "(student, is taking, bag), (student, is stepping over, backpacks), (student, is glancing, over shoulder), (student, is giving, smile), (student, is grazing, classmate's arm)"
  ],
  "blackboard_writing": [
    "(The teacher, is writing, on the blackboard)",
    "(math teacher, is writing, equations), (students, watch, math teacher), (students, take, notes)",
    "(math teacher, is writing, equations), (math teacher, making, eye contact), (math teacher, checking, for understanding), (math teacher, gestures, with chalk), (math teacher, inviting, questions)"
  ],
  "blackboard_wiping": [
    "(Ms. Thompson, is wiping, the chalk), (Ms. Thompson, is wiping off, the blackboard)",
    "(Ms. Thompson, is wiping, the chalk dust), (students, watch, Ms. Thompson), (students, waiting to solve, the next math problem)",
    "(Ms. Thompson, stretches, to erase the top of the blackboard), (Ms. Thompson, leaves, no trace of chalk), (Ms. Thompson, glances, over her shoulder), (Ms. Thompson, offers, a reassuring smile to her students), (students, scribble notes, in their classroom)"
  ],
  "taking_off": [
    "(The teacher, is taking off, her coat)",
    "(The teacher, is taking off, her coat), (The teacher, enters, the busy classroom), (A student, hangs, it on a coat rack)",
    "(teacher, enters, classroom), (teacher, smiles at, students), (teacher, takes off, coat), (student, receives, coat), (teacher, gestures towards, coat rack)"
  ],
  "student_demonstrating": [
    "(The student, is demonstrating, a chemistry experiment), (The student, is using, a Bunsen burner), (The student, is using, test tubes)",
    "(The student, is demonstrating, a chemistry experiment), (The student, is mixing, chemicals in test tubes), (Peers, are watching, the student), (Chemistry teacher, is guiding, the student)",
    "(student, stands, at front of classroom), (student, pours, solution from one test tube to another), (chemistry teacher, nods, approvingly), (chemistry teacher, makes, small gestures), (class, watches, with rapt attention)"
  ],
  "eating": [
    "(The teacher, is eating, an apple)",
    "(the teacher, is eating, apple), (the teacher, is sharing, pieces), (curious students, are during, lunch break)",
    "(Teacher, leans slightly forward, slices of apple), (Teacher, offers, slices of apple), (Teacher, eats, apple), (Teacher, nods, smiles), (Teacher, engages, students)"
  ],
  "reviewing": [
    "(The teacher, is reviewing, the students' essays), (The reviewing, is happening, in the brightly lit classroom)",
    "(The teacher, is reviewing, the students' essays), (The teacher, is providing, helpful feedback)",
    "(The teacher, leans forward, to hand back marked essays to the students), (The teacher, adjusts, her glasses), (The teacher, nods encouragingly, as she engages with students), (The teacher, offers, occasional smiles), (The teacher, answers, their questions)"
  ],
  "handsup": [
    "(The teacher, hands up, the chalk)",
    "(The teacher, hands up, the chalk), (The student, is at, the front of the classroom), (Other students, watch, eagerly)",
    "(teacher, hands up, chalk), (teacher, makes, eye contact), (teacher, offers, nod), (student, stretches out, hand), (students, lean forward, in seats)"
  ],
  "speaking": [
    "(The teacher, is speaking, to the students)",
    "(The teacher, is speaking, to the students), (The teacher, is pointing, at the images)",
    "(The teacher, is speaking, to the students), (The teacher, gestures, towards the images), (The teacher, peers, over her glasses), (The teacher, ensures, students are engaged), (The teacher, highlights, key points)"
  ],
  "picking_up_computers": [
    "(The IT technician, is picking up, computers), (The IT technician, is updating, software)",
    "(IT technician, is picking up, computers), (computers, are from, student's desk), (students, gather around, process), (technician, update, software)",
    "(IT technician, picks up, computers), (IT technician, explains, update process), (IT technician, points to, screens)"
  ]
}