{
  "listening": [
    "(The teacher, is listening to, the students)",
    "(The teacher, is listening, to the students)",
    "(The teacher, is leaning, against the whiteboard), (The teacher, is listening, to the students), (She, nods, thoughtfully), (She, interjects, with a question), (She, interjects, with a word of encouragement)"
  ],
  "reading": [
    "(The teacher, is reading, a novel), (The teacher, is seated, at the front desk)",
    "(The teacher, is reading, a captivating novel), (The students, are sitting, with their eyes fixed on the teacher), (The students, are listening, intently)",
    "(teacher, is reading, novel), (teacher, glances up, making eye contact with students), (teacher, gestures, emphasizing points in story), (students, lean forward, in their seats), (students, react, to plot)"
  ],
  "using_phone": [
    "(Sarah, is using, phone), (Sarah, is at, desk), (desk, is in, back corner), (back corner, is in, classroom)",
    "(Sarah, is using, her phone), (Sarah, is sitting, at her desk)",
    "(Sarah, seated at, her desk), (Sarah, uses, her phone), (Sarah, nods, subtly), (Sarah, jots down, notes), (Sarah, blends, digital engagement with classroom discussion)"
  ],
  "using_pad": [
    "(The student, is using, a pad)",
    "(student, is using, digital pad), (classmates, discuss, lecture content)",
    "(student, leans forward, slightly), (eyes, flicking between, digital pad and teacher), (student, nods, in understanding), (student, frowns, in concentration), (student, tapping on, screen)"
  ],
  "using_computers": [
    "(The students, are using, computers), (The students, are completing, their assignments)",
    "(The students, are using, computers), (The students, are assisted by, their teacher), (The students, are in, the school's computer lab), (The students, complete, their science assignments)",
    "(students, are seated at, individual workstations), (students, using, computers), (teacher, offers, guidance), (teacher, answers, questions), (student, shares, smile with classmate)"
  ],
  "scratching_head": [
    "(student, is scratching, head), (student, is trying, to solve problem), (problem, is, complex algebra problem), (student, is at, desk), (desk, is in, classroom)",
    "(student, is scratching, head), (student, is trying, to solve problem), (classmates, are glancing over, student), (teacher, is approaching, to offer help), (teacher, is approaching, student)",
    "(student, is scratching, head), (student, is gripping, pencil), (student, tries to solve, algebra problem), (student, glances up, snippets of teacher's explanations), (classmates, peer over, in curiosity)"
  ],
  "writing": [
    "(The student, is writing, an essay)",
    "(The student, is writing, an essay), (The teacher, is offering, guidance and feedback)",
    "(student, is writing, diligently), (student, pushes, glasses), (student, scans, room), (teacher, approaches, with smile), (teacher, offers, insight and encouragement)"
  ],
  "talking": [
    "(The teacher, was talking to, the students)",
    "(Teacher, was talking to, students), (Students, were scattered across, classroom), (Classroom, was, brightly-lit)",
    "(The teacher, was talking to, the students), (The teacher, was gesturing, with her hands), (The teacher, was making, eye contact), (The classroom, was, brightly-lit)"
  ],
  "standing": [
    "(The teacher, was standing in front of, the whiteboard), (The teacher, was addressing, the students)",
    "(teacher, was standing in front of, whiteboard), (teacher, gesturing towards, diagram), (teacher, explained, concept), (students, were, attentive)",
    "(The teacher, used, a marker), (The teacher, underlined, key terms on the board), (The teacher, glanced around, the classroom), (The teacher, made, eye contact with students), (The teacher, ensure, their engagement and understanding)"
  ],
  "sleeping": [
    "(The student, was sleeping, at the back of the classroom), (The student, was resting, her head on the desk)",
    "(The student, was sleeping, at the back of the classroom), (Her classmates, worked, on their assignments)",
    "(The student, was sleeping, at the back of the classroom), (She, would twitch, in her sleep), (She, stirring, at the hum of the projector), (Classmates, were working, diligently)"
  ],
  "teaching": [
    "(teacher, was teaching, students), (classroom, was, brightly-lit)",
    "(teacher, was teaching, students), (teacher, was using, whiteboard), (teacher, was using, markers), (classroom, was, brightly-lit), (classroom, was, well-organized)",
    "(teacher, gestured towards, whiteboard), (teacher, walked around, engaging students), (teacher, made, eye contact), (teacher, gave, encouraging nods), (teacher, ensured, student understood material)"
  ],
  "yawning": [
    "(The teacher, noticed, several students)",
    "(The teacher, noticed, several students yawning), (The teacher, noticed, students struggling to keep their eyes open)",
    "(teacher, noticed, students yawning), (teacher, scanned, room), (teacher, leaned forward, with concerned expression), (teacher, made, eye contact)"
  ],
  "walking": [
    "(The teacher, was walking between, the desks), (The teacher, was checking, the students' assignments)",
    "(The teacher, was walking between, the crowded desks), (The teacher, was guiding, students), (The teacher, was glancing over, their assignments)",
    "(teacher, walked between, desks), (teacher, leaned over, occasionally), (teacher, brushed against, papers), (teacher, checked, assignment), (teacher, encouraging, atmosphere)"
  ],
  "relaxing": [
    "(The teacher, is relaxing, in her chair), (The teacher, is taking, a short break)",
    "(The teacher, is relaxing, in her chair), (The teacher, is sipping, a cup of tea), (The teacher, is enjoying, a quiet moment)",
    "(Teacher, is relaxing in, chair), (She, sips, tea), (She, glancing at, artwork), (Her eyes, roam over, stack of papers), (She, resists, urge to start grading)"
  ],
  "analyzing": [
    "(The biology teacher, is analyzing, the chemical reaction)",
    "(biology teacher, is analyzing, chemical reaction), (students, gather, to observe color change)",
    "(biology teacher, leans over, lab table), (biology teacher, analyzes, chemical reaction), (biology teacher, encourages, students to take notes), (biology teacher, swirls, beaker), (biology teacher, points out, changes to audience)"
  ],
  "taking_bottle": [
    "(The teacher, is taking, a bottle of water)",
    "(students, watch, attentively), (teacher, is standing, at front of classroom), (classroom, is, brightly-lit), (teacher, is taking, bottle of water), (desk, is, cluttered)",
    "(teacher, reaches out, bottle of water), (teacher, takes, bottle of water), (teacher, nods, at student's question), (teacher, maintains, eye contact with students), (teacher, signals, active engagement)"
  ],
  "gathering_up_bag": [
    "(Ms. Thompson, is gathering up, her bag)",
    "(Ms. Thompson, is gathering, her bag), (students, file out, the door)",
    "(Ms. Thompson, leans over, desk), (Ms. Thompson, gathers up, her bag), (Ms. Thompson, nods at, students), (students, are saying, goodbye), (Ms. Thompson, scans, the room)"
  ],
  "drinking": [
    "(Ms. Thompson, is drinking, coffee), (Ms. Thompson, is overseeing, her students' work)",
    "(Ms. Thompson, is drinking, coffee), (Ms. Thompson, is glancing, monitor), (students, are writing, essays)",
    "(Ms. Thompson, sips, coffee), (Ms. Thompson, acknowledges, student's raised hand), (Ms. Thompson, indicates, readiness to assist), (student discussions, fills, the air)"
  ],
  "taking_photos": [
    "(The teacher, is taking photos of, the students)",
    "(The teacher, is taking photos, of the students), (the students, painting, at their easels), (the art class, capturing, concentration and creativity)",
    "(The teacher, moves around, the classroom), (The teacher, takes, photos of the students), (The teacher, kneels down, to capture the brush strokes), (The teacher, makes sure, the light illuminates the artwork), (The students, paint, at their easels)"
  ],
  "listening_to_music": [
    "(Sarah, is listening to, music)",
    "(Sarah, is listening to, music), (Sarah, is tapping, her foot)",
    "(Sarah, is sitting, in the last row), (Sarah, is listening to, music), (Teacher, discusses, historical events), (Sarah, keeps, one earbud hidden), (Sarah, maintains, appearance of attentiveness)"
  ],
  "discussing": [
    "(students, are discussing, theories), (theories, of, quantum mechanics), (classroom, is, brightly lit)",
    "(students, are discussing, theories), (theories, are of, quantum mechanics), (classroom, is, brightly lit)",
    "(students, are gathered, around lab table), (students, discuss, theories of quantum mechanics), (students, jotting down, notes), (surroundings, are, brightly lit classroom)"
  ],
  "setting_equipment": [
    "(The teacher, is setting up, the equipment)",
    "(teacher, is setting up, projector), (teacher, is setting up, laptop), (students, gather around, presentation)",
    "(teacher, adjusts, projector), (teacher, connects, laptop), (teacher, glances around, to ensure students are focused), (teacher, nods, to students), (students, shuffle, closer)"
  ],
  "taking_bag": [
    "(Ms. Johnson, is taking, her bag)",
    "(Ms. Johnson, is taking, her bag), (Ms. Johnson, is maneuvering around, group of students), (students, gathered around, her), (students, are for, after-class discussion), (discussion, in, classroom)",
    "(Ms. Johnson, reaches to grasp, her bag), (Ms. Johnson, smiles at, students), (Ms. Johnson, nods at, explanations), (Ms. Johnson, maintains, demeanor), (students, clustered around, Ms. Johnson)"
  ],
  "blackboard_writing": [
    "(The teacher, is writing on, the blackboard), (students, watch, attentively)",
    "(The teacher, is writing, equations), (Students, take, notes), (Students, discuss, the problem)",
    "(teacher, grips, chalk), (teacher, writes, equations), (teacher, adjusts, glasses), (teacher, scans, classroom), (teacher, makes, eye contact)"
  ],
  "blackboard_wiping": [
    "(The teacher, is wiping, the blackboard), (The teacher, is standing, in front of the classroom)",
    "(teacher, is wiping, chalk dust), (students, watch, teacher)",
    "(teacher, stretches, upper corners of the blackboard), (teacher, balances, on her tiptoes), (teacher, erases, old equations), (teacher, glances back, to ensure students are following), (teacher, engages, students with nods and gestures)"
  ],
  "taking_off": [
    "(The teacher, is taking off, her coat), (she, enters, the classroom)",
    "(The teacher, is taking off, her coat), (The teacher, enters, the classroom), (A student, helps, her), (A student, is holding, the door)",
    "(teacher, enters, classroom), (teacher, smiles at, students), (student, holds, door), (student, catches, teacher's eye), (teacher, earns, nod of appreciation)"
  ],
  "student_demonstrating": [
    "(The student, is demonstrating, a science experiment)",
    "(The student, is demonstrating, a chemical reaction), (The student, is using, beakers and test tubes), (The student, is demonstrating, in front of the entire class), (The student, is demonstrating, in front of the science teacher)",
    "(The student, mixes chemicals, into beakers), (The student, makes eye contact, with peers), (The student, makes eye contact, with teacher), (The teacher, nods, appreciatively), (The teacher, encourages, her effort)"
  ],
  "eating": [
    "(The teacher, was eating, an apple)",
    "(The teacher, was eating, a crisp apple), (The students, were reading, their books)",
    "(The teacher, was eating, apple), (She, glanced up, from her snack), (She, offering, gentle smiles), (She, observed, her students)"
  ],
  "reviewing": [
    "(The teacher, is reviewing, the students' essays), (The teacher, is in, the crowded classroom)",
    "(The teacher, is reviewing, the students' essays), (The students, await, feedback)",
    "(The teacher, is reviewing, the students' essays), (The teacher, peers over, her glasses), (The teacher, gives, a nod of approval), (The students, lean forward, to catch her comments and insights)"
  ],
  "handsup": [
    "(The teacher, hands up, the book)",
    "(teacher, hands up, book), (student, eager to, answer question)",
    "(teacher, hands up, book), (teacher, reaches out with, gentle smile), (student, leans forward in, anticipation), (student, has, sparkling eyes), (student, ready to engage in, lesson)"
  ],
  "speaking": [
    "(The teacher, is speaking to, the students)",
    "(The teacher, is speaking to, the attentive students), (The teacher, is holding, a textbook), (The classroom, is, brightly lit)",
    "(teacher, is speaking to, students), (teacher, is holding, textbook), (teacher, is gesturing towards, whiteboard), (gesturing, is eliciting, nods and notes), (gesturing, is eliciting, notes from students)"
  ],
  "picking_up_computers": [
    "(the teacher, is picking up, computers)",
    "(The teacher, is picking up, laptops), (students, stayed behind, to help), (students, to help, organize the classroom)",
    "(teacher, picks up, laptop), (teacher, places, laptop into charging cart), (teacher, straightens, stack of papers), (teacher, aligns, chair), (teacher, exchanges words with, students)"
  ]
}